# St7ScaleBySphericalUCS

Scales the radius of selected entities in a spherical coordinate system.

long St7ScaleBySphericalUCS(long uID, long UCSId, double Factor)
Input Parameters
uID
Strand7 model file ID.
UCSId
The spherical coordinate system in which to scale.
Factor
Factor by which to scale the radius.
Dependencies
Selection
Entities can be selected using functions in Entity Selection.
Keep Selected
Assigned using St7SetKeepSelect.